## Pandas(Series, DataFrame)
- 고수준의 1, 2차원 데이터 분석 도구 포함
- numpy 기반으로 개발
- from pandas import Series, DataFrame
- import pandas as pd
- Series: 1차원 데이터+index  => numpy와 달리 인덱스를 수동으로 지정할 수 있음
- DataFrame: 2차원 데이터+Raw index+Column index  => numpy와 달리 행과 열 인덱스를 수동으로 지정 가능
- Row index(df.index), Column index(df.columns), Values(Series의 집합)
- DataFrame의 한행 혹은 한 개의 열을 구성하는 자료구조(1차원):Series 
- numpy <Series < DataFrame  => Series와 DataFrame 모두 numpy를 기반으로 하고 있고 Series가 모여 DataFrame이 됨   
- Series는 판다스의 객체임

## Series

In [3]:
# 아래 내용들 중 선택해서 실행하면 됨
from pandas import Series, DataFrame 
# Series는 1차원 자료 구조로 ndarry(데이터)와 index(인덱스)로 구성돼 있음

# 위의 내용을 import할 때
# s = pd.Series([1, 2, 3, 4])  이렇게 Series 클래스를 사용
#df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}) DataFrame 클래스를 사용

from pandas import Series as my_series, DataFrame as my_dataframe
# 이렇게 둘 다 한 번에 별칭을 줘서 사용하기도 함

import pandas as pd

import numpy as np

In [3]:
# from pandas import Series, DataFrame 이 형태로 쓰는 경우
# 인덱스 지정 따로 없으면 디폴트 인덱스(0번부터 진행되는 순번 인덱스) 사용됨

ser = Series([4, 7, -5, 3], dtype=np.int32) # 데이터와 자료형만 있음
ser
# Series는 인덱스가 키가 되고 밸류가 값이 되는 형태로 출력됨[1차원 자료 구조]

0    4
1    7
2   -5
3    3
dtype: int32

In [4]:
#import pandas as pd에서 Series를 쓰는 경우

ser = pd.Series([4, 7, -5, 3], dtype=np.int32) 
ser

0    4
1    7
2   -5
3    3
dtype: int32

In [5]:
ser[0]  # 인덱스를 주지 않았어도 Series의 기본 자료형이 ndarry(자료구조)이므로 방 번호는 0부터 시작

4

In [6]:
ser.index  #인덱스 객체를 확인했을 때 RangeIndex(start=0, stop=4, step=1) 
# 시작이 0이고 3번방에서 끝나고 1개씩 증가

RangeIndex(start=0, stop=4, step=1)

In [7]:
list(ser.index)

[0, 1, 2, 3]

In [8]:
# Series의 기본 구성 요소는 인덱스(index)와 밸류스(values)됨
# .values를 하면 인덱스를 제외한 값만 나옴

ser.values, type(ser.values)  #  기본 데이터는 ndarray를 사용한다[자료 타입에서 확인됨]

(array([ 4,  7, -5,  3]), numpy.ndarray)

In [9]:
ser.index=['a','b','c','d']    # 인덱스 수동 지정 예시

In [ ]:
# Pandas는 데이터 타입을 자동으로 유추해 해당 정보를 제공, 
# 이를 통해 데이터를 처리하는 데 있어 데이터 타입에 대한 이해를 도움. 
# Series 객체를 출력할 때, 'type: int32'와 같이 이렇게 dtype(자료형) 정보가 함께 나타납

In [10]:
ser

a    4
b    7
c   -5
d    3
dtype: int32

In [11]:
# ndarry의 디폴트 인덱스의 values와 수동으로 준 인덱스의 values가 같음
# 인덱스 설정 후에도 둘 다 사용 가능

ser[0], ser['a']

(4, 4)

In [12]:
ser.values[0]    # values를 이용해 값에 접근하려면 수동 인덱스로는 접근 불가. 디폴트 인덱스 이용.

4

In [13]:
ser.values['a']   # IndexError => values가 ndarray이므로 인덱스 수기 설정은 지원 안 돼 오류남
ser.values[0]    # 오류 없음(ndarray의 인덱스는 디폴트 인덱스뿐이므로)

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [14]:
# 색인 지정
ser2=Series([4, 7, -5, 3], index=['d','b','a','a'])  #Series의 인덱스 수기 설정은 중복도 가능
ser2                                                 # 인덱스의 고의적 중복을 통해 필요값 추출 가능

d    4
b    7
a   -5
a    3
dtype: int64

In [15]:
ser2.index           # Series의 기본 구성 요소 index

Index(['d', 'b', 'a', 'a'], dtype='object')

In [16]:
ser2.values           # Series의 기본 구성 요소 values

array([ 4,  7, -5,  3], dtype=int64)

In [17]:
type(ser2.values)    # values는 numpy.ndarray임

numpy.ndarray

In [18]:
ser2['a'] = 10    # a 인덱스에 10을 넣게 되면 a가 index인 모든 곳의 values가 10이 됨
ser2

d     4
b     7
a    10
a    10
dtype: int64

In [19]:
ser2[['a','b']]   # numfy에서 동시에 여러 개의 값을 주고자 리스트 사용하듯 시리즈도 동일
# 여기서는 a 인덱스와 b 인덱스를 동시에 가져오라는 의미로 인덱스 안에 리스트 사용함

a    10
a    10
b     7
dtype: int64

In [20]:
type(ser2[['a','b']])     # pandas.core.series.Series => 자료 타입이 시리즈

pandas.core.series.Series

In [23]:
# 불리언 인덱싱 (Series도 numpy와 동일)
ser2[ser2>5]

b     7
a    10
a    10
dtype: int64

In [24]:
ser2>5   # ser2가 5보다 큰 경우의 연산을 ndarry처럼 원소마다 반복

# 이를 브로드캐스팅이라 함):전체 ser2 원소에 >5를 적용하므로
# numpy가 연산 결과를 numpy로 리턴했듯 Series의 리턴 값 자료구조도 Series임

d    False
b     True
a     True
a     True
dtype: bool

In [25]:
# Broadcasting  (한 개의 방송국에서 전체의 구성 멤버에게 전파하는 것)
ser2 * 2

d     8
b    14
a    20
a    20
dtype: int64

In [26]:
# Numpy의 유니버설 함수를 Series에서도 사용 가능
# exp는 유니버설 함수 중 지수함수이고 전체 원소에 이 값을 다 적용되어 결과 나옴(브로드캐스팅처럼)

np.exp(ser2)

d       54.598150
b     1096.633158
a    22026.465795
a    22026.465795
dtype: float64

In [27]:
# 인덱스에 a가 포함되어 있는가?
'a' in ser2   # True

True

In [28]:
# 인덱스에 e가 포함되어 있는가?
'e' in ser2   # False

False

In [29]:
# dict 사용하여 index, values 생성 가능
sample_dict = {
    'Ohio' : 35000,
    'Texes' : 71000,
    'Oregon' : 16000,
    'Utah' : 5000
}

In [30]:
# 딕셔너리 키/밸류 구조가 시리즈랑 동일해서 딕셔너리로 Series를 만들 수 있음
# 출력은 Series 타입이므로 1차원 자료구조일 뿐 여러 줄로 되어있대서 행이 여러 개 있는 거 아니니 주의

ser3= pd.Series(sample_dict)  
ser3

Ohio      35000
Texes     71000
Oregon    16000
Utah       5000
dtype: int64

In [31]:
# 인덱스 순서 변경
# sample_dict 안에 있는 인덱스의 순서를 변경하고자 index=[] 값을 설정하여 추가
# 출력은 Series 타입이므로 1차원 자료구조일 뿐 여러 줄로 되어있대서 행이 여러 개 있는 거 아니니 주의

ser4 = Series(sample_dict, index=['Oregon','Ohio','Texes','Utah'])
ser4

Oregon    16000
Ohio      35000
Texes     71000
Utah       5000
dtype: int64

In [36]:
ser5 = Series(sample_dict, index=['Oregon','Ohio','Texes','Utah','California']) # 'California' 추가
ser5   # California 인덱스는 기존에 존재하지 않았기 때문에 values 값이 NaN으로 표시됨

# 수가 아니라는 의미로 NaN(Not A Number의 약자로 null 값임을 의미함)

# 실제 데이터 수집을 하다 보면 null 값이 들어갈 수도 있어서 이러한 방식으로 찾아 전처리를 위해 필요

Oregon        16000.0
Ohio          35000.0
Texes         71000.0
Utah           5000.0
California        NaN
dtype: float64

## pd.isnull(), pd.notnull()
- isnull() : NaN,NA 등의 누락된 값이 있는 경우 True, 그 외에는 False(null이 아니면 False)
- notnull() : NaN,NA 등의 누락된 값이 있는 경우 False(null이면 False), 그 외에는 True

In [33]:
pd.isnull(ser5)   # NaN 인 위치는 True, 아니면  False   (불리언 배열 리턴)

Oregon        False
Ohio          False
Texes         False
Utah          False
California     True
dtype: bool

In [34]:
# 결측치(누락된 값)를 찾아서 특정값으로 대치하는 예) 방법1`   [데이터 전처리 과정]
 
ser5[ser5.isnull()] = 10   # 또는 ser5[pd.isnull(ser5)] = 10
ser5

Oregon        16000.0
Ohio          35000.0
Texes         71000.0
Utah           5000.0
California       10.0
dtype: float64

In [38]:
# 결측치(누락된 값)를 찾아서 특정값으로 대치하는 예) 방법2   [데이터 전처리 과정]
ser5[pd.isnull(ser5)] = 11
ser5

Oregon        16000.0
Ohio          35000.0
Texes         71000.0
Utah           5000.0
California       11.0
dtype: float64

In [37]:
pd.notnull(ser5)

Oregon         True
Ohio           True
Texes          True
Utah           True
California    False
dtype: bool

In [39]:
# 인덱스 'California' 자리에 NaN(여기선 NULL의 의미) 값을 주고자 할 때 

ser5['California']=np.NaN
ser5

Oregon        16000.0
Ohio          35000.0
Texes         71000.0
Utah           5000.0
California        NaN
dtype: float64

In [90]:
# NaN이 아닌 곳의 데이터 평균을 구하기

ser5_mean = ser5[ser5.notnull()].mean()   # ser5.notnull()이 True인 곳만 값을 가져옴

#ser5_mean = ser5[pd.notnull(ser5)].mean()   # 위와 동일  [pd.notnull(ser5) 이 부분은 불리언 인덱싱]

ser5_mean

31750.0

In [92]:
# 위에 나온 값을 가지고(NaN이 아닌 곳의 데이터 평균을 구했다면)
# 평균 값을 NaN 자리에 대신 넣고자 할 때   [결측치 메꾸기]
ser5[pd.isnull(ser5)] = ser5_mean
ser5

Oregon        16000.0
Ohio          35000.0
Texes         71000.0
Utah           5000.0
California    31750.0
dtype: float64

In [93]:
# np.isnull(ser5)에서 isnull()은 라이브러리 np 안에 들어 있으므로 함수임 
# ser5.isnull()에서 isnull()은 인스턴스 ser5 안에 들어 있으므로 메소드임

# 위의 기능은 인스턴스 메소드를 사용할 수도 있다

ser5.isnull()   
ser5.notnull()

Oregon        True
Ohio          True
Texes         True
Utah          True
California    True
dtype: bool

In [94]:
ser34_add = ser3 + ser4  # 동일 인덱스를 찾아 덧셈
ser34_add    

# 벡터 연산이 가능 (인덱스가 같은 것끼리 찾아서 계산해줌)
# 두 Series 객체를 더할 때, 
# 판다스는 동일한 인덱스를 찾아 해당 데이터를 더하고 결과를 새로운 Series 객체에 저장
# 벡터 연산이 가능한 이유는 판다스의 Series 객체 때문

Ohio       70000
Oregon     32000
Texes     142000
Utah       10000
dtype: int64

In [95]:
ser34_add.name = 'sum of ser3 and ser4'    # Series에 name을 줄 수도 있음
ser34_add                                  # 출력 값에 name이 나옴 (기능과 무관)

Ohio       70000
Oregon     32000
Texes     142000
Utah       10000
Name: sum of ser3 and ser4, dtype: int64

In [96]:
ser = pd.Series([1,2,3,4], index=['a','b','c','d'])
ser.values[0]=5   # values는 ndarray이므로 순번(색인 번호) 인덱스로 주었음
ser

a    5
b    2
c    3
d    4
dtype: int64

In [40]:
# values는 ndarray이므로 값에 대한 접근은 ndarray 방식만 사용 가능
# ser.values['a']=7    => 오류남
ser['a']=7
ser

a    7
b    7
c   -5
d    3
dtype: int32

## DataFrame
- 2차원 데이터 표현(표와 같은 형식)
- 각 컬럼은 자료형이 달라도 된다
- 숫자, 문자열, 불리언 값을 지정
- Values(df.values로 접근), Row index(df.index로 접근), Column index(df.columns로 접근)

In [3]:
import pandas as pd

In [9]:
# 2차원 자료 구조
# 키가 컬럼이 되고 값이 데이터로 옴/ index 안 주면 기본 디폴트 생성

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9]
}
data


# 오라클과 같이 RDBMS(Relational Database Management System, 
# RDBMS는 관계형 데이터베이스 관리 시스템)에서는 행(Row) 기반 중심.
# RDBMS 데이터베이스를 구성, 관리, 유지 보수하는 데 사용되는 소프트웨어.

# 빅데이터에선 유지 보수가 목적이 아닌 데이터를 가지고 분석해[통계] AI 애플리케이션 구축이 목적.
# 빅데이터에선 'state'(키)가 컬럼이고 ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada']이 컬럼 데이터임

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [310]:
frame=pd.DataFrame(data)  # DataFrame 생성
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [311]:
frame['state']    # 특정 컬럼을 다 가져오기

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [312]:
frame[0]     # 특정 행을 다 가져오기(행 기반이었을 때에는 이 방법 되었으나 여기선 안 됨)
frame   # KeyError

KeyError: 0

In [313]:
# DF의 행 다루기
frame.loc[0]  


# Row 인덱스기 주어지면 Row 인덱스만 이용 가능(현재는 디폴트 값으로 돼 있어 iloc[]와 동일) 
# Row index를 지정한 경우에 사용

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

In [314]:
# DF의 행 다루기
frame.iloc[0]    # 행에 접근 방법  iloc => 인덱서

# 디폴트 색인 번호만 사용 가능

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

In [369]:
# 행 이름을 수동으로 지정하기
frame.index=['A','B','C','D','E']
frame

    state  year  pop
A    Ohio  2000  1.5
B    Ohio  2001  1.7
C    Ohio  2002  3.6
D  Nevada  2001  2.4
E  Nevada  2002  2.9

In [316]:
frame['year']

A    2000
B    2001
C    2002
D    2001
E    2002
Name: year, dtype: int64

In [317]:
# 인덱서(Indexer)는 판다스에서 데이터를 참조하거나 검색하는 방법을 제공하는 특수 메소드
# loc 인덱서(인덱싱 하기 위함)

frame.loc['C']    # 행 인덱스가 'C'인 행

state    Ohio
year     2002
pop       3.6
Name: C, dtype: object

In [117]:
frame.loc[2]   # 행 인덱스가 설정된 상태일 경우에는 KeyError 발생

KeyError: 2

In [318]:
# 인덱서(Indexer)는 판다스에서 데이터를 참조하거나 검색하는 방법을 제공하는 특수 메소드
# 인덱서 iloc (인덱싱 하기 위함)

frame.iloc[2]     # 디폴트 행 인덱스(정수)만 []에 입력 가능

state    Ohio
year     2002
pop       3.6
Name: C, dtype: object

In [319]:
frame.iloc['C']   # TypeError

TypeError: Cannot index by location index with a non-integer key

In [320]:
# DataFrame에서 컬럼 위치 바꾸기
frame2 = pd.DataFrame(data, columns=['state','pop','year'])
frame2

    state  pop  year
0    Ohio  1.5  2000
1    Ohio  1.7  2001
2    Ohio  3.6  2002
3  Nevada  2.4  2001
4  Nevada  2.9  2002

In [6]:
# DataFrame에서 컬럼 위치 바꾸기 + 행 인덱스 수동 설정하기

frame3=pd.DataFrame(data,
        columns=['state','year','pop'],
        index=['가','나','다','라','마'])
frame3   
# DataFrame에 shift+tab을 눌러 도움말로 구조 확인시 데이터, 인덱스, 컬럼스 순서로 써야 하나 
# 이름을 명시하는 경우에는 상관없음. 이러한 방식을 "키워드 인자"라고 함

    state  year  pop
가    Ohio  2000  1.5
나    Ohio  2001  1.7
다    Ohio  2002  3.6
라  Nevada  2001  2.4
마  Nevada  2002  2.9

In [10]:
# 키워드를 주지 않고 DataFrame 생성시의 디폴트 순서대로 써줘서 실행해보기

frame3=pd.DataFrame(data,
        ['가','나','다','라','마'],  # 행 (인덱스)
        ['state','year','pop'])      # 열 (컬럼스)
frame3                               # 원본 변경됨

    state  year  pop
가    Ohio  2000  1.5
나    Ohio  2001  1.7
다    Ohio  2002  3.6
라  Nevada  2001  2.4
마  Nevada  2002  2.9

In [322]:
frame3.columns

Index(['state', 'year', 'pop'], dtype='object')

In [323]:
frame3.index

Index(['가', '나', '다', '라', '마'], dtype='object')

In [8]:
frame3                     # 원본 변경됨

    state  year  pop
가    Ohio  2000  1.5
나    Ohio  2001  1.7
다    Ohio  2002  3.6
라  Nevada  2001  2.4
마  Nevada  2002  2.9

In [324]:
frame3['state']       # frame3.state 과 결과 동일  
frame3.state          # frame3['state']와 결과 동일

가      Ohio
나      Ohio
다      Ohio
라    Nevada
마    Nevada
Name: state, dtype: object

In [11]:
frame3['year']  
frame3.year        # 둘 다 결과 동일

가    2000
나    2001
다    2002
라    2001
마    2002
Name: year, dtype: int64

In [12]:
frame3

    state  year  pop
가    Ohio  2000  1.5
나    Ohio  2001  1.7
다    Ohio  2002  3.6
라  Nevada  2001  2.4
마  Nevada  2002  2.9

In [14]:
# 컬럼 기반으로 특정값 추출하기   예) 2000 추출하기

res = frame3['year']
type(res)                # 타입을 알아야 다룰 수 있으므로 타입 체크부터 확인.
     # pandas.core.series.Series  -> 1차원. 열 타입이 판타스임을 알 수 있음

pandas.core.series.Series

In [328]:
res.index

Index(['가', '나', '다', '라', '마'], dtype='object')

In [329]:
res.values

array([2000, 2001, 2002, 2001, 2002], dtype=int64)

In [330]:
res[0]   # 시리즈를 이용  2000 찾기

2000

In [331]:
res['가']   # 시리즈를 이용 2000 찾기

2000

In [15]:
res[0],res['가']   # 이렇게 쓰면 튜플로 반환됨  (2000, 2000)

(2000, 2000)

In [332]:
# 행 기반으로 특정값 추출하기 예) 2000 추출하기

frame3.loc['가']     #  열 전체 확인

state    Ohio
year     2000
pop       1.5
Name: 가, dtype: object

In [333]:
res=frame3.loc['가']
res

state    Ohio
year     2000
pop       1.5
Name: 가, dtype: object

In [334]:
type(res)  # pandas.core.series.Series 1차원. 행 타입이 판타스임을 알 수 있음

pandas.core.series.Series

In [335]:
res[1], res['year']

(2000, 2000)

In [336]:
# 행과 열 동시에 하나의 [ ]써서 값 가져오려면
# => 행 기반으로 특정값 찾아야 함. 
#즉 loc나 iloc 필요(이름으로 찾기- [행> 열])

# pandas가 라벨(이름) 기반 인덱싱을 지원. 
# 데이터프레임은 행과 열의 이름을 가지는 인덱스로 데이터에 접근하거나 조작. 
# 이는 행 번호나 열 번호가 아닌 라벨(이름)을 사용하는 것을 의미

frame3.loc['가','year']  # 2000 찾기

2000

In [337]:
# 행 기반으로 특정값 찾기  (인덱스 번호로 찾기 - [행> 열])

frame3.iloc[0,1]    # 2000 찾기

2000

In [338]:
# 열[컬럼]을 기반으로 특정값 찾기  (이름과 인덱스로 찾기- [열]> [행])

frame3['year'][0]   # 2000 찾기

#(frame3['year']까지가 시리즈라 그 옆에 인덱스[0] 등을 붙여서 가져오기 가능

2000

In [339]:
# 열[컬럼]을 기반으로 특정값 찾기  (이름으로 찾기- [열]> [행])

frame3['year']['가']   # 2000 찾기
# (frame3['year']까지가 시리즈라 설정 인덱스['가'] 등을 붙여서 가져오기 가능

2000

In [340]:
# 행 기반으로 특정값 찾기  (이름과 인덱스로 찾기- [행]> [열])

frame3.loc['가'][1]   # 2000 찾기
# (frame3['가']까지가 시리즈라 그 옆에 인덱스[0] 등을 붙여서 가져오기 가능
# 자료 타입을 먼저 알아야 이렇게 인덱스를 옆에 무엇을 둘 수 있는지 확인 가능

2000

In [341]:
del frame3['지울 행 이름']  # 행 지우는 방법

KeyError: '지울 행 이름'

In [16]:
frame3

    state  year  pop
가    Ohio  2000  1.5
나    Ohio  2001  1.7
다    Ohio  2002  3.6
라  Nevada  2001  2.4
마  Nevada  2002  2.9

In [342]:
frame3.iloc[0]     # 행 전체 확인

# 데이터가 나오고 인덱스가 나오니 type 안 써봐도
# 자료타입이 시리즈임을 알 수 있음

state    Ohio
year     2000
pop       1.5
Name: 가, dtype: object

In [343]:
# 행 기반으로 특정값 찾기  (인덱스 번호로 찾기 - [행]> [열])

frame3.iloc[0][1]  # 2000 찾기
#(frame3.iloc[0]까지가 시리즈라 그 옆에 인덱스[0] 등을 붙여서 가져오기 가능)

2000

In [344]:
# 행 기반으로 특정값 찾기  (인덱스 번호로 찾기 - [행 > 열])

frame3.iloc[0,1] # 2000 찾기([0][1]이면 numpy에서 합치기 가능하므로)

2000

In [345]:
# 인덱서 안에서는 항상 왼쪽이 행, 오른쪽이 열이 옴

frame3.iloc[0][1], frame3.iloc[0,1]  # 튜플로 결과 나옴

(2000, 2000)

In [12]:
# 컬럼 추가하기(데이터도 같이 넣기)

frame3['price']=[30,45,37,42,56]
frame3

    state  year  pop  price
가    Ohio  2000  1.5     30
나    Ohio  2001  1.7     45
다    Ohio  2002  3.6     37
라  Nevada  2001  2.4     42
마  Nevada  2002  2.9     56

In [13]:
frame3['price']=0  

# frame3['price'] => 시리즈라서 브로드캐스팅이 기본 되니까 다섯개의 행이 0으로 바뀜
# frame3['price'] 시리즈에 스칼라 값을 더하면 시리즈 내의 모든 원소에 스칼라 값이 더해집니다. 
# 이렇게 시리즈 내의 모든 원소에 동일한 연산을 적용하는 것이 브로드캐스팅의 특징입니다.
frame3

    state  year  pop  price
가    Ohio  2000  1.5      0
나    Ohio  2001  1.7      0
다    Ohio  2002  3.6      0
라  Nevada  2001  2.4      0
마  Nevada  2002  2.9      0

In [14]:
# frame3['price'] 시리즈니까 리스트 아닌 시리즈로도 값 주기 가능
# 문제) price 컬럼에 값을 입력할 때 Series를 생성하여 전달해보세요

frame3['price']=pd.Series([34,45,67,89,90], index=['다','나','가','라','마']) # 인덱스 순서 바꿈 가능
frame3

    state  year  pop  price
가    Ohio  2000  1.5     67
나    Ohio  2001  1.7     45
다    Ohio  2002  3.6     34
라  Nevada  2001  2.4     89
마  Nevada  2002  2.9     90

In [15]:
# 34 위치를 null로 만들기
frame3.iloc[2,3]=np.NaN
frame3

    state  year  pop  price
가    Ohio  2000  1.5   67.0
나    Ohio  2001  1.7   45.0
다    Ohio  2002  3.6    NaN
라  Nevada  2001  2.4   89.0
마  Nevada  2002  2.9   90.0

In [16]:
frame3.iloc[2,3]=np.NaN
frame3

    state  year  pop  price
가    Ohio  2000  1.5   67.0
나    Ohio  2001  1.7   45.0
다    Ohio  2002  3.6    NaN
라  Nevada  2001  2.4   89.0
마  Nevada  2002  2.9   90.0

In [22]:
frame3.loc['다','price']=40
frame3

    state  year  pop  price
가    Ohio  2000  1.5   67.0
나    Ohio  2001  1.7   45.0
다    Ohio  2002  3.6   40.0
라  Nevada  2001  2.4   89.0
마  Nevada  2002  2.9   90.0

In [18]:
# 행 기반으로 값 바꾸기

frame3.loc['다', 'price'] = np.NaN
frame3        # 경고 없이 원본값이 변경됨

    state  year  pop  price
가    Ohio  2000  1.5   67.0
나    Ohio  2001  1.7   45.0
다    Ohio  2002  3.6    NaN
라  Nevada  2001  2.4   89.0
마  Nevada  2002  2.9   90.0

In [25]:
# 열 기반으로 값 바꾸기 

frame3['price']['다'] =np.NaN
frame3      

# 경고와 함께 원본값이 변경됨[복사본에만 적용될 수 있다는 경고임]

C:\Users\정진화\AppData\Local\Temp\ipykernel_21284\4016840661.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  frame3['price']['다'] =np.NaN

    state  year  pop  price
가    Ohio  2000  1.5   67.0
나    Ohio  2001  1.7   45.0
다    Ohio  2002  3.6    NaN
라  Nevada  2001  2.4   89.0
마  Nevada  2002  2.9   90.0

In [379]:
pd.isnull(frame3)  # null인 곳을 불리언 값으로 표시해줌

   state   year    pop  price
가  False  False  False  False
나  False  False  False  False
다  False  False  False   True
라  False  False  False  False
마  False  False  False  False

In [386]:
pd.notnull(frame3)   # null이 아닌 곳을 불리언 값으로 표시해줌

   state   year    pop  price
가  False  False  False  False
나  False  False  False  False
다  False  False  False   True
라  False  False  False  False
마  False  False  False  False

In [422]:
~pd.notnull(frame3)    

# null이 아닌 곳을 불리언 값으로 표시해준 것을 반전시켜서 null인 곳을 불리언 값으로 표시(not의 의미)
# -pd.notnull(frame3) 도 위와 동일(-1 곱하기 되어서...)   
# 연산자를 부울 데이터에 적용할 경우 Python은 부울 값을 정수로 자동 형변환하여 계산하고, 그 결과를 다시 부울 값으로 변환. 
# 이로 인해 예상치 못한 결과가 발생할 수 있기 때문에, 
# 부울 데이터에 대해 부정 연산을 수행하려면 ~ 연산자를 사용. 이것이 더 일관성 있고 안전한 방식

   state   year    pop  price
가  False  False  False  False
나  False  False  False  False
다  False  False  False   True
라  False  False  False  False
마  False  False  False  False

In [384]:
frame3.isnull().sum()  # null이 몇 개인지 확인시켜줌 

#( False는 0, True는 1로 계산됨)

state    0
year     0
pop      0
price    1
dtype: int64

In [357]:
frame3

    state  year  pop  price
가    Ohio  2000  1.5   67.0
나    Ohio  2001  1.7   45.0
다    Ohio  2002  3.6    NaN
라  Nevada  2001  2.4   89.0
마  Nevada  2002  2.9   90.0

In [63]:
# 중첩된 사전으로부터 데이터프레임을 만들 수 있다
# 딕셔너리 안이 딕셔너리 
# 바깥 딕셔너리의 키가 컬럼명이 됨.
# 딕셔너리 안의 딕셔너리의 키가 행(Row) 이름이 됨, 
# 딕셔너리 안의 딕셔너리 밸류 값이 데이터가 됨
# 행의 정렬은 컬럼의 입력순으로 되므로 
# 컬럼 Nevada가 2001, 2002라서 먼저 생성 후 
# 그 다음 컬럼인 Ohio의 2000이 맨 마지막 행으로 가게 됨.
# 즉 오름차순 정렬이 아닌 입력순 정렬이 됨

pop = {'Nevada':{2001:2.4,
                 2002:2.9},
       'Ohio':  {2000:1.5,
                 2001:1.7,
                 2002:3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [41]:
type(pop)   # dict
pop.shape, pop.ndim   # AttributeError 오류

# 딕셔너리 객체는 shape와 ndim이라는 속성을 갖고 있지 않으므로 오류가 발생. 
# shape와 ndim 속성은 NumPy 배열 (np.array) 또는 
# pandas DataFrame (pd.DataFrame)과 같은 다차원 배열 객체에서 사용할 수 있음

AttributeError: 'dict' object has no attribute 'ndim'

In [64]:
frame3=DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [40]:
type(frame3),    # pandas.core.frame.DataFrame
frame3.shape,    # (3, 2) => 3행 2열
frame3.ndim      #  2  => 2차원

(pandas.core.frame.DataFrame, (3, 2), 2)

In [360]:
# 판다스 데이터프레임에서 열(column)에 접근하려면 
# frame3['컬럼명'] 형태로 적어주면 됨
# 그 다음에 컬럼의 인덱스 적어주면 데이터 가져옴

frame3['Ohio'][0:2]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [361]:
frame3['Nevada'][:2]

2001    2.4
2002    2.9
Name: Nevada, dtype: float64

In [51]:
# 행과 열을 바꿀 수 있다 (transpose)
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [52]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [59]:
# 인덱스를 명시적으로 지정할 수 있다
# 값이 없으면 NaN이 된다
# frame3으로 DataFrame 생성하면서 인덱스 재배치 방법

DataFrame(frame3, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [60]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [61]:
#  'Ohio': frame3['Ohio'][:-1]=> 컬럼명은 'Ohio'로 하고
# => 데이터는 frame3['Ohio'] 여기까지는 컬럼명이고, [:-1]는 처음부터 끝까지므로
# => frame3의 Ohio 컬럼의 처음부터 끝 이전 인덱스까지의 데이터를 가져옴

# 즉, 다른 데이터프레임으로부터 데이터를 가져오는 방법

pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [65]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [55]:
# 인덱스와 열의 이름을 별도로 지정할 수 있다
# 원본이 변경됨
# 세미콜론을 사용하면 한 줄에 여러 개의 명령을 구분하여 작성할 수 있지만, 반드시 사용해야 하는 규칙은 아님. 
# 줄바꿈을 사용하여 각 명령을 다른 라인에 작성하거나 세미콜론을 이용해 한 줄에 사용하거나 하면 됨

frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [ ]:
pop = {'Nevada':{2001:2.4,
                 2002:2.9},
       'Ohio':  {2000:1.5,
                 2001:1.7,
                 2002:3.6}}
pop

In [ ]:
frame3=DataFrame(pop)
frame3

In [66]:
#  세미콜론 쓰고 행과 열 이름 주기를 한 줄에 썼을 때와 결과 동일

frame3.index.name = 'year' 
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [68]:
# 데이터프레임에서도 내용만 보려면 value를 사용한다
# 2차원 ndarray가 결과로 리턴됨(즉, numpy 배열 리턴)

frame3.values, type(frame3.values)

(array([[2.4, 1.7],
        [2.9, 3.6],
        [nan, 1.5]]),
 numpy.ndarray)

In [69]:
# in 연산자 사용

'Ohio' in frame3.columns

True

In [70]:
2010 in frame3.index

False

In [71]:
# ndarry인 values 안에서 1.5 찾기

1.5 in frame3.values

True

In [72]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__deprecated_num_index_names',
 '__dir__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_testing',
 '_typing',
 '_version',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [73]:
# 판다스 모듈을 이용(pd.Index 함수를 사용)해 pandas 인덱스 객체 생성 가능
# NumPy 배열 np.arange(3)을 사용해 0부터 2까지의 정수 인덱스를 갖는 인덱스 객체를 생성.

index = pd.Index(np.arange(3))  #pd.index로 쓰면 AttributeError오류남
index                           # 원소 3개

Int64Index([0, 1, 2], dtype='int64')

In [74]:
index2= pd.Index(np.arange(5))     # 원소 5개
index2

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [76]:
sum_index=index.append(index2)  # 생성된 인덱스 객체끼리 합치기 가능
sum_index                       # 수동 생성시엔 인덱스 중복 가능

Int64Index([0, 1, 2, 0, 1, 2, 3, 4], dtype='int64')

In [286]:
# 시리즈 생성 => 데이터 [4.5, 7.2, -5.3, 3.6]와 인덱스 ['d','b','a','c']

ser = Series([4.5, 7.2, -5.3, 3.6], index=['d','b','a','c'])
ser

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [287]:
# 시리즈의 인덱스를 변경

ser.reindex(['a','b','c','d','e'])  # 변경된 사본을 리턴함

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [288]:
ser # 원본은 변경되지 않았음

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [291]:
# 인덱스만 있고, 데이터가 없는 경우에는 0으로 채운다

ser.reindex(['a','b','c','d','e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [292]:
ser # 원본은 변경되지 않았음

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [78]:
ser = pd.Series(['blue','purple','yellow'], index=[0,2,3])
ser

0      blue
2    purple
3    yellow
dtype: object

In [79]:
ser.reindex(range(6),)  # 빈자리 NaN 값 나옴

0      blue
1       NaN
2    purple
3    yellow
4       NaN
5       NaN
dtype: object

In [295]:
# NaN에 있는 앞의 값으로 NaN 값을 채우기  => method='ffill'

ser.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    yellow
4    yellow
5    yellow
dtype: object

In [83]:
ser = pd.Series(['blue','purple','yellow','pink'], index=[0,2,3,6])
ser

0      blue
2    purple
3    yellow
6      pink
dtype: object

In [84]:
# 기존 데이터 값을 유지하려는 목적으로 range(7)다음에 쉼표 씀
#  인덱스가 변경될 때, 해당 값을 기존 시리즈와 맞추는 방법을 제공
# method 인수를 생략하면 기존 인덱스와 일치하는 데이터 값만 유지되고, 
# 나머지 인덱스엔 NaN 값이 할당됨

ser.reindex(range(7),)

0      blue
1       NaN
2    purple
3    yellow
4       NaN
5       NaN
6      pink
dtype: object

In [86]:
# NaN에 있는 뒤의 값으로 NaN 값을 채우기 => method='bfill'
# 설령, 인덱스 6이 안 보여도 그 값을 이용해 값을 채움
    
ser.reindex(range(7), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4      pink
5      pink
6      pink
dtype: object

In [89]:
# 인덱스 4번째 자리 다시 NaN 만들기

# 인덱스 재지정
ser_new = ser.reindex(range(7), method='bfill')
ser_new.at[4] = np.NaN  # 또는 ser_new.loc[4] = np.NaN
ser_new

# at은 라벨 기반의 인덱스(사용자 지정 인덱스) 허용, 슬라이스 허용 안 하고 단일 값만 허용
# loc는 라벨 기반의 인덱스(사용자 지정 인덱스) 허용, 슬라이스 허용

0      blue
1    purple
2    purple
3    yellow
4       NaN
5      pink
6      pink
dtype: object

In [90]:
# 인덱스 4번째~5번째 자리 다시 NaN 만들기

ser_new = ser.reindex(range(7), method='bfill')
ser_new.loc[4:5] = np.NaN
ser_new

0      blue
1    purple
2    purple
3    yellow
4       NaN
5       NaN
6      pink
dtype: object

In [92]:
# NaN 자리에 원하는 값 넣기(결측값 채우기)

ser_new[pd.isnull(ser_new)] = 'green'
ser_new

0      blue
1    purple
2    purple
3    yellow
4     green
5     green
6      pink
dtype: object

In [301]:
# 데이터 프레임 생성 위해
# 데이터를 빠르게 채우기 위해 array를 쓰고 2차원 자료 구조를 만들기 위해 3행 3열로 만듬 [reshape((3,3))]
# 데이터만 가지고 있는 데이터 프레임[디폴트 값만 가지고 있음]

frame = pd.DataFrame(np.arange(9).reshape((3,3)))
frame

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [302]:
# 디폴트 표에서 인덱스명과 컬럼명을 생성

frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=['a','c','d'],
                    columns=['Ohio','Texas','Callifornia'])
frame

   Ohio  Texas  Callifornia
a     0      1            2
c     3      4            5
d     6      7            8

In [303]:
# 행 인덱스 재배치 (인덱스'b' 추가)
# reindex 쓰고 바꿀 행 인덱스명 바로 써 줌

df2=frame.reindex(['a','b','c','d'])
df2

   Ohio  Texas  Callifornia
a   0.0    1.0          2.0
b   NaN    NaN          NaN
c   3.0    4.0          5.0
d   6.0    7.0          8.0

In [304]:
# 컬럼 인덱스를 재배치하려면, reindex() 사용시 columns 키워드를 사용한다
# Ohio 제거하고 Utah를 추가

frame.reindex(columns=['Texas','Utah','Callifornia'])

   Texas  Utah  Callifornia
a      1   NaN            2
c      4   NaN            5
d      7   NaN            8

In [305]:
# 행 인덱스 재배치+ 컬럼 인덱스 재배치
# 둘 다 바꾸므로 키워드 인자 주워야 함

frame.reindex(index=['a','b','c','d'], columns=['Texas','Utah','Callifornia'])

   Texas  Utah  Callifornia
a    1.0   NaN          2.0
b    NaN   NaN          NaN
c    4.0   NaN          5.0
d    7.0   NaN          8.0

In [307]:
# 인덱스를 재배치하면서 NaN 값에 0도 채워넣는 방법  fill_value=0
# 앞의 값이나 뒤의 값으로 채우려면 method='ffill'이나 method='bfill'을 줘야 하나 컬럼 전체 데이터가 NaN이라 그렇게 하면 오류

frame.reindex(index=['a','b','c','d'], 
              columns=['Texas','Utah','Callifornia'], fill_value=0)

   Texas  Utah  Callifornia
a      1     0            2
b      0     0            0
c      4     0            5
d      7     0            8

## 행, 열 삭제

In [4]:
# 시리즈 생성 : 데이터는 4까지 인덱스는 'a','b','c','d','e'
# 1차원 데이터에서 drop 이용 삭제하기 

ser= Series(np.arange(5.), index=['a','b','c','d','e'])
ser

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [5]:
# drop으로 행 삭제하기 => 삭제된 사본이 리턴됨 [행 1개 삭제]

new_ser = ser.drop('c')
new_ser

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [6]:
ser

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [391]:
# 1차원에서 drop으로 행 삭제하기 => [다수 개 행 삭제]
# 다수 개를 할 때는 뭐든 리스트로 묶어줘야 함

ser.drop(['d','c'])

a    0
b    1
e    4
dtype: int32

In [11]:
# 2차원. 행과 열이 구분되는 데이터 프레임에서 drop 하기
# 먼제 데이터 프레임 생성

df = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [9]:
help(df.drop) 
# 함수 도움말 볼 때 괄호까지 쓰면 형식을 다 지켜야 하므로 괄호 뺴고 확인


# axis=0은 행(Row)을 의미
# axis=1은 열(컬럼)을 의미


# - 다양한 삭제 방법 -

# 열 삭제)
# df.drop('컬럼명1', axis=1)   => 컬럼 삭제(단일 열도 [] 써도 됨) 
# df.drop(['컬럼명1', '컬러명2'], axis=1) => 컬럼 삭제 

# 행 삭제)
# df.drop('행 이름(인덱스명)', axis=0) => 행 삭제 (단일 행도 [] 써도 됨) 
# df.drop(['행 이름(인덱스명)', '행 이름(인덱스명)'], axis=0) => 행 삭제 
# df.drop([0, 1])  => 0번과 1번 인덱스 행 삭제(인덱스 색인으로 삭제시)

# - 다중 인덱스 사용시 삭제 - 
# df.drop(index=('상위 행 이름', '하위 행 이름')) => 행 삭제시 상위 행> 하위 행
# df.drop(index='행 이름', level=1) => 행 이름과 그 행의 라벨 번호
# level은 다중 인덱스 사용시 level=0부터 시작, level=1은 그 안의 세부 인덱스
# level=0: 첫 번째 행 인덱스 레벨 
# level=1: 두 번째 행 인덱스 레벨
# 열(column) 인덱스도 다중 인덱스 구조를 가질 수 있음
        
# - 행과 열 삭제 -    
# df.drop(index='행 이름', columns='컬럼 이름') => 행과 열 동시 삭제시

Help on method drop in module pandas.core.frame:

drop(labels: 'IndexLabel' = None, *, axis: 'Axis' = 0, index: 'IndexLabel' = None, columns: 'IndexLabel' = None, level: 'Level' = None, inplace: 'bool' = False, errors: 'IgnoreRaise' = 'raise') -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by specifying directly index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level. See the `user guide <advanced.shown_levels>`
    for more information about the now unused levels.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop. A tuple will be used as a single
        label and not treated as a list-like.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index : single label or list-like
        Alternative to specifying axis (``labels, axis=0``
        is equivalent to ``index=labels``).
    columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If False, return a copy. Otherwise, do operation
        inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    DataFrame or None
        DataFrame without the removed index or column labels or
        None if ``inplace=True``.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis.

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3, 0.2]])
    >>> df
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    Drop a specific index combination from the MultiIndex
    DataFrame, i.e., drop the combination ``'falcon'`` and
    ``'weight'``, which deletes only the corresponding row

    >>> df.drop(index=('falcon', 'weight'))
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    lama    speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [394]:
df.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [397]:
# 컬럼(열) 삭제
df2=df.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [398]:
df  # 원본은 그대로임  [즉 삭제 사본은 따로 저장해둬야 함]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
df2= df.drop(['two', 'four'], axis=1)
df2

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [13]:
df  # 원본은 그대로임  [즉 삭제 사본은 따로 저장해둬야 함]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 인덱싱, 선택, 거르기
- Series의 인덱싱은 설정된 이름이나 디폴트 정수를 사용해도 된다
- ser[0], ser['a'], ser[[0,1]], ser[['a','b']] => ser[0], ser['a']은 인덱스 0과 a 자리 값(데이터) 가져오기/ ser[[0,1]]는 인덱스 0과 1의 자리 값(데이터) 가져오기,  ser[['a','b']]은 인덱스 a와 b의 자리 값(데이터) 가져오기
- ser[불리언 인덱싱]
- df['컬럼명'], df[['c1','c2']]
- df[불리언 인덱싱]
- df.loc[인덱스], df.loc['r1','c1'], df.loc[['r1','r2'],[c1','c2']]  => df.loc['r1','c1']는 행 r1과 열 c1의 인덱스 자리 값(데이터) 가져오기 [시리즈를 리턴]  /  df.loc[['r1','r2'],[c1','c2']]는 행 r1, r2와 열 c1, c2의 인덱스 자리 값 (데이터) 가져오기[데이터 프레임을 리턴]
- df.loc[['r1','r2'],[c1','c2']] => 이것은 인덱스 안의 리스트를 가져오는데 그게 행과 열이므로 2차원으로 가져오게 되어 데이터 프레임을 만듬
- df.iloc[디폴트 정수], 패턴은 loc와 같음

In [14]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [407]:
# 5보다 적은 데이터 가져오기

df<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [15]:
df[df<5]  # 데이터 출력  (참인 곳만 값을 보여줌. 선택/출력)

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [22]:
df[df<5]=5    # 데이터 입력. 선택/입력
df

          one  two  three  four
Ohio        5    5      5     5
Colorado    5    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
# 문제)
# df으로부터 한 개의 셀 값을 추출하여 그 자료형을 확인해보세요
# df으로부터 한 개의 컬럼 내에서 다수 개를 추출하여 그 자료형 확인
# df으로부터 다수 개의 행, 다수 개의 컬럼에서 값을 추출하여 그 자료형 확인

In [417]:
# 내가 푼 버전

import pandas as pd

data = {
    'column_1': [1, 2, 3],
    'column_2': [4, 5, 6],
    'column_3': [7, 8, 9]
}

df = pd.DataFrame(data)
df

   column_1  column_2  column_3
0         1         4         7
1         2         5         8
2         3         6         9

In [413]:
df.iloc[0,0]   #  한 개의 셀 값

1

In [414]:
type(df.iloc[0,0])  #  한 개의 셀 값의 자료형  numpy.int64 (scala)

numpy.int64

In [420]:
df.iloc[[0,1,2],[0]]  # 한 개의 컬럼 내에서 다수 개 추출 (강사님과 다름)

   column_1
0         1
1         2
2         3

In [421]:
type(df.iloc[[0,1,2],[0]])

pandas.core.frame.DataFrame

In [416]:
type(df.iloc[[0,1],[0,1]])

pandas.core.frame.DataFrame

In [ ]:
# 문제)
# df으로부터 한 개의 셀 값을 추출하여 그 자료형을 확인해보세요
# df으로부터 한 개의 컬럼 내에서 다수 개를 추출하여 그 자료형 확인
# df으로부터 다수 개의 행, 다수 개의 컬럼에서 값을 추출하여 그 자료형 확인

In [29]:
df

          one  two  three  four
Ohio        5    5      5     5
Colorado    5    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
# 강사님 버전 답)

ret = df.iloc[0,0]
ret  # scala 데이터 리턴됨

5

In [24]:
ret = df.iloc[0,[0,1]]
ret  # Series 리턴됨

# 판다스에서 인덱싱할 때 슬라이스 결과는 
# 여러 값이 선택되는 경우 시리즈 또는 데이터 프레임으로 반환됨
# [0,1]에서 여러 개의 열이 선택되었으므로, 
# 선택한 열들의 데이터를 시리즈 형태로 리턴하게 되어 값과 인덱스가 표시됨

one    5
two    5
Name: Ohio, dtype: int32

In [25]:
ret = df.iloc[[0,1],[0,1]]
ret   # DataFrame  

# 행 인덱스 0과 1 그리고 열 인덱스 0과 1의 값과 인덱스를 리턴됨
# 시리즈가 두 개 이상이 나오므로 2차원이 되니 데이터 프레임이 리턴됨
# 여러 값과 여러 값의 관계를 2차원으로 표현하는 것은 
# 행과 열이라는 두 개의 축을 사용하여 데이터를 구성할 수 있기 때문, 
# 이를 통해 데이터를 분석하고 이해하기 쉽게 만드는 데 도움.

          one  two
Ohio        5    5
Colorado    5    5

In [31]:
df

          one  two  three  four
Ohio        5    5      5     5
Colorado    5    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
# 행은 처음부터 끝까지 가져오고 열은 인덱스 1에 해당하는 값 가져오기
# => 즉 열의 인덱스 1 자리인 하나의 컬럼 전체 가져오게 됨
# df.iloc[:,1] => 시리즈가 리턴 됨

df.iloc[:,1]>10

Ohio        False
Colorado    False
Utah        False
New York     True
Name: two, dtype: bool

In [36]:
df

          one  two  three  four
Ohio        5    5      5     5
Colorado    5    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [39]:
df.iloc[:,1]>10   # 불리언 시리즈 리턴됨

Ohio        False
Colorado    False
Utah        False
New York     True
Name: two, dtype: bool

In [40]:
bool_exp = df.iloc[:,1]>10

In [41]:
type(bool_exp)

pandas.core.series.Series

In [43]:
 bool_exp.tolist()

[False, False, False, True]

In [42]:
# 인덱서 가져올 때 컬럼 조건에는 불리언 인덱싱을 사용하기 

# 자료형 인덱서 안에는 시리즈를 둘 수 없음
# 인덱서 안에서 허용된 자료 구조는 다수개를 표현할 때 리스트만 허용됨
# 불리언 시리즈를 리스트로 바꿔서 열로 표시하면 됨

df.iloc[0:2, bool_exp.tolist()]

# df.iloc[0:2, [False, False, False, True]] 와 같으므로 True자리인 그곳의 값만 반환되니 열 자리 반환됨
# True값이 4번째 위치에 있으므로, 4번째 열('four')이 선택되는 것

          four
Ohio         5
Colorado     7

## 이름(행, 열)으로 슬라이싱할 때는 양 끝 점이 포함된다

- 기본 디폴트 인덱스는 마지막 숫자 준 값이 있으면 그 전의 자리까지만 가져오나 이름으로 줄 때는 다름
- df.iloc[0:2]: 0, 1 행이 선택(행 슬라이싱)
- df.loc['a':'c']: a, b, c 행이 선택(행 슬라이싱)
- df.loc[:,'가':'다' ]:가,나,다 열 선택(열 슬라이싱)
- df.iloc[0:2]:0,1 행이 선택

In [426]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [429]:
# 이름으로 줄 때

df.loc[:,'one':'two']  # one과 'two' 둘 다 선택돼 출력됨(양 끝점이 모두 포함됨)

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [428]:
# 인덱스로 줄 때 

df.iloc[:, 0:1]   # 0만 선택돼 출력됨(끝점은 stop으로 사용되어 포함되지 않음)

          one
Ohio        0
Colorado    4
Utah        8
New York   12

In [430]:
df['two']      # 열 기준 (열은 이름만 주면 값을 가져오므로)

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [431]:
df[['one','two']]   # 열 기준 다수개를 지정할 때는 리스트 사용

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [46]:
# 인덱스 안에
# 이름을 주면 컬럼 기준이 되나 슬라이싱을 하면 행 기준이 됨

# 이렇게 슬라이싱이나 불리언 배열을 사용하면 행을 기준으로 선택
df[:2]   # 0,~1  2개의 행

          one  two  three  four
Ohio        5    5      5     5
Colorado    5    5      6     7

In [47]:
df

          one  two  three  four
Ohio        5    5      5     5
Colorado    5    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [434]:
df['one']>5   # 시리즈 리턴됨

Ohio        False
Colorado    False
Utah         True
New York     True
Name: one, dtype: bool

In [433]:
# 불리언 값을 줘도 행 기준으로 선택 
# 1차원을 가지고 2차원을 리턴
# 1차원 불리언 시리즈를 사용하여 DataFrame에서 행이나 열을 필터링하면, 
# 자동으로 2차원 DataFrame 형태로 결과가 반환됨
# 인덱스 안에 불리언 주면 컬럼을 가지고 행을 선택해 가져옴

df[df['one']>5]   

# 실행 순서
# df['one'] => one 컬럼을 가져옴
# ['one']>5 => one 컬럼에서 5보다 큰 행을 가져옴 그 다음에 
# df[df['one']>5]는 거기에 해당되는 다른 컬럼의 행들도 무조건 가져오라는 의미임

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [49]:
# 슬라이싱이라 행 기반. 이름을 써서 행 인덱스 여러 개 가져오기 
df['Ohio':'Utah']

          one  two  three  four
Ohio        5    5      5     5
Colorado    5    5      6     7
Utah        8    9     10    11

In [443]:
# 이름을 이용하여 다수 개의 행을 선택하고 그 안에서 다수 개의 컬럼을 선택하여 표시
 # 행과 열을 슬라이싱해 가져오기
    
df.loc['Ohio':'Colorado', 'two':'four']

          two  three  four
Ohio        1      2     3
Colorado    5      6     7

In [448]:
# 행은 슬라이싱으로 열은 리스트를 이용해 가져오기 
# 행은 연속된 값 가져올 때, 리스트는 일부 추출해 가져올 때 사용하기

df.loc['Ohio':'Colorado', ['two','three','four']]

          two  three  four
Ohio        1      2     3
Colorado    5      6     7

In [447]:
# 리스트를 이용해서 행과 열을 다수 개 가져오기 

df.loc[['Ohio','Colorado'], ['two','three','four']]

          two  three  four
Ohio        1      2     3
Colorado    5      6     7

In [50]:
df

          one  two  three  four
Ohio        5    5      5     5
Colorado    5    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [54]:
df['two']>5

Ohio        False
Colorado    False
Utah         True
New York     True
Name: two, dtype: bool

In [52]:
(df['two']>5).tolist()

[False, False, True, True]

In [53]:
df.loc['Ohio':'Colorado',(df['two']>5).tolist()]
# (df['two']>5).tolist()가 [False, False, True, True]니까 인덱스 2와 인덱스 3을 가져오라는 의미임

          three  four
Ohio          5     5
Colorado      6     7

## 산술연산

In [449]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [450]:
# 짝이 있는 것은 더해주고 짝이 없는 것은 NaN으로 표시됨
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [56]:
# np.arange(9.) => 실수를 나타내기 위해 점을 찍었으며 8.0까지 출력됨

# 0.1 단위로 하려면 데이터의 간격을 조절해야 하는데, 간격을 설정하지 않으면 기본값인 1.0이 사용되기 때문
# array = np.arange(0, 8.9, 0.1)  => 이렇게 하면 8.8까지 0.1 단위로 나옴    
# array = np.arange(0, 9.0, 0.1)  => 이렇게 하면 8.9까지 0.1 단위로 나옴   

df1 = DataFrame(np.arange(9.).reshape((3, 3)),  
                columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [57]:
# columns=list('bde')는 columns=['b','d','e']와 동일

df2 = DataFrame(np.arange(12.).reshape((4, 3)),
                columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [58]:
# 값이 한쪽이라도 없으면 NaN이 나옴(덧셈 상대가 없으면 NaN)
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [59]:
df1.add(df2)  # 위와 동일

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [60]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [61]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [458]:
# 한쪽 상대가 없으면 0으로 채움, 양쪽 모두 없으면 NaN

df1.add(df2, fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [459]:
df1, df2

(            b    c    d
 Ohio      0.0  1.0  2.0
 Texas     3.0  4.0  5.0
 Colorado  6.0  7.0  8.0,
           b     d     e
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0)

In [460]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [461]:
# print는 맨 마지막 한 번만 쓰면 됨
print(df1)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [464]:
display(df1)   # print 를 써야 하나 표로 보고 싶다면?
display(df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [465]:
#add, sub, div, mul

### Broadcasting

In [63]:
frame = DataFrame(np.arange(12.).reshape((4, 3)),
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [64]:
# 인덱스 '0'의 행 가져오기 
ser = frame.iloc[0]
ser

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [468]:
# 브로드캐스팅에 의한 뺄셈
# 2차원에서 1차원을 빼도 numfy처럼 브로드캐스팅으로 인해 가능.
# 행 2개에서 각각 ser을 빼게 되는 것
# 이름(라벨)을 찾아서 빼기를 함
# 단, 행의 원소 갯수와 빼려는 원소 갯수가 동일해야 함

frame - ser   # frame 각 행에서 ser 값을 뺀다

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [68]:
frame   # 원본 동일

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [65]:
ser2 = Series(range(3), index=['b','e','f'])
ser2

b    0
e    1
f    2
dtype: int64

In [66]:
# 브로드개스팅에 의한 덧셈
#  pandas는 자동으로 인덱스와 컬럼의 레이블을 기준으로 사용하여 연산을 진행. 
# 이를 "브로드캐스팅"이라 함
# 브로드캐스팅 규칙에 따라 판다스는 열(column) 방향으로 ser2의 값들을 브로드캐스팅하여 frame의 각 행에 대해 계산을 수행

frame + ser2   # frame의 각 행에 ser2를 더한다   # ser이 1차원, frame이 2차원인데도 가능

# 연산과정에서 이름을 찾아 덧셈 수행. 한쪽이라도 짝이 없으면 값이 NaN이 됨

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [72]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [71]:
ser

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [69]:
frame.add(ser)  # 덧셈 (ser이 1차원, frame이 2차원인데도 가능)

          b     d     e
Utah    0.0   2.0   4.0
Ohio    3.0   5.0   7.0
Texas   6.0   8.0  10.0
Oregon  9.0  11.0  13.0

In [471]:
frame.sub(ser)  # 뺄셈 (ser이 1차원, frame이 2차원인데도 가능)

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [73]:
# 표준 수학에서 0으로 나누는 것은 정의되지 않은 연산으로 pandas에서는 이 값을 NaN으로 처리함
# 즉, 0 나누기 0은 NaN으로 처리함
# inf는 무한대를 의미하는 'infinity'의 약자
# 연산 과정에서 양수를 0으로 나눴을 때 결과 값이 무한대['infinity'(inf)]로 처리

frame.div(ser)  # 나눗셈(ser이 1차원, frame이 2차원인데도 가능)

          b     d    e
Utah    NaN   1.0  1.0
Ohio    inf   4.0  2.5
Texas   inf   7.0  4.0
Oregon  inf  10.0  5.5

In [473]:
frame.mul(ser)  # 곱셈(ser이 1차원, frame이 2차원인데도 가능)

          b     d     e
Utah    0.0   1.0   4.0
Ohio    0.0   4.0  10.0
Texas   0.0   7.0  16.0
Oregon  0.0  10.0  22.0

## 함수 적용, 매핑

In [75]:
# randn은 표준정규분포로 평균이 0이고 표준편차가 1임

frame = DataFrame(np.random.randn(4, 3),
                  columns=['b', 'd', 'e'],
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.273310 -2.511725  0.153381
Ohio    0.564593 -0.260594  2.064632
Texas   1.150681  0.695585 -0.994101
Oregon -2.968150 -0.532528 -1.763507

In [76]:
# abs가 유니버설 함수(파라미터로 값을 받아 다 처리해주는 함수)

np.abs(frame)  # 절대값 만들기  frame이 2차원인데도 가능

               b         d         e
Utah    1.273310  2.511725  0.153381
Ohio    0.564593  0.260594  2.064632
Texas   1.150681  0.695585  0.994101
Oregon  2.968150  0.532528  1.763507

In [78]:
frame  # 원본 동일

               b         d         e
Utah   -1.273310 -2.511725  0.153381
Ohio    0.564593 -0.260594  2.064632
Texas   1.150681  0.695585 -0.994101
Oregon -2.968150 -0.532528 -1.763507

In [79]:
# exp도 유니버설 함수라 파라미터로 값을 받아 지수값으로 다 처리
# np.exp(-1.273310)은 자연 상수 e(약 2.71828)를 -1.273310승한 결과를 계산

np.exp(frame)

               b         d         e
Utah    0.279904  0.081128  1.165769
Ohio    1.758732  0.770594  7.882397
Texas   3.160343  2.004882  0.370056
Oregon  0.051398  0.587119  0.171443

In [86]:
ser=Series([-2, -3, 1, 2, 0], index=['A', 'B', 'C', 'C', 'D'])
ser

A   -2
B   -3
C    1
C    2
D    0
dtype: int64

In [87]:
# 2.718282(자연상수 e)의 ser의 원소 지수의 값이 나옴

np.exp(ser)

A    0.135335
B    0.049787
C    2.718282
C    7.389056
D    1.000000
dtype: float64

In [ ]:
# 주요 정리

# axis=0은 행을 의미하나 연산시에는 세로 방향(열 기준)으로 진행됨[행들이 대상]

# axis=1은 열을 의미하나 연산시에는 가로 방향(행 기준)으로 진행됨[열 들이 대상]

# drop시에는 axis=0을 주면 행 삭제/axis=1을 쓰면 열 삭제됨

In [91]:
# 람다 함수 만들기

# 시스템에서 처리 못하는 데이터 프레임의
# 숫자들을 어떤 기준에 맞춰 바꾸고 싶을 때 람다 함수를 만들어 사용

# 함수 x를 x의 '최댓값에서 최솟값의 차'라고 정의하고 그 참조 주소를 f에 담음 
# f는 다른 곳에서도 이 식을 호출해서 쓸 때만 필요. 한 곳에서만 쓰는 경우엔 람다식 그대로 씀

f = lambda x: x.max()-x.min()

In [89]:
frame

               b         d         e
Utah   -1.273310 -2.511725  0.153381
Ohio    0.564593 -0.260594  2.064632
Texas   1.150681  0.695585 -0.994101
Oregon -2.968150 -0.532528 -1.763507

In [484]:
help(frame.apply)

# apply는 함수를 받는 함수로 쓰고 싶은 함수를 apply에 넣어 쓸 수 있음

Help on method apply in module pandas.core.frame:

apply(func: 'AggFuncType', axis: 'Axis' = 0, raw: 'bool' = False, result_type: "Literal['expand', 'reduce', 'broadcast'] | None" = None, args=(), **kwargs) method of pandas.core.frame.DataFrame instance
    Apply a function along an axis of the DataFrame.

    Objects passed to the function are Series objects whose index is
    either the DataFrame's index (``axis=0``) or the DataFrame's columns
    (``axis=1``). By default (``result_type=None``), the final return type
    is inferred from the return type of the applied function. Otherwise,
    it depends on the `result_type` argument.

    Parameters
    ----------
    func : function
        Function to apply to each column or row.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Axis along which the function is applied:

        * 0 or 'index': apply function to each column.
        * 1 or 'columns': apply function to each row.

    raw : bool, default False
        Determines if row or column is passed as a Series or ndarray object:

        * ``False`` : passes each row or column as a Series to the
          function.
        * ``True`` : the passed function will receive ndarray objects
          instead.
          If you are just applying a NumPy reduction function this will
          achieve much better performance.

    result_type : {'expand', 'reduce', 'broadcast', None}, default None
        These only act when ``axis=1`` (columns):

        * 'expand' : list-like results will be turned into columns.
        * 'reduce' : returns a Series if possible rather than expanding
          list-like results. This is the opposite of 'expand'.
        * 'broadcast' : results will be broadcast to the original shape
          of the DataFrame, the original index and columns will be
          retained.

        The default behaviour (None) depends on the return value of the
        applied function: list-like results will be returned as a Series
        of those. However if the apply function returns a Series these
        are expanded to columns.
    args : tuple
        Positional arguments to pass to `func` in addition to the
        array/series.
    **kwargs
        Additional keyword arguments to pass as keywords arguments to
        `func`.

    Returns
    -------
    Series or DataFrame
        Result of applying ``func`` along the given axis of the
        DataFrame.

    See Also
    --------
    DataFrame.applymap: For elementwise operations.
    DataFrame.aggregate: Only perform aggregating type operations.
    DataFrame.transform: Only perform transforming type operations.

    Notes
    -----
    Functions that mutate the passed object can produce unexpected
    behavior or errors and are not supported. See :ref:`gotchas.udf-mutation`
    for more details.

    Examples
    --------
    >>> df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
    >>> df
       A  B
    0  4  9
    1  4  9
    2  4  9

    Using a numpy universal function (in this case the same as
    ``np.sqrt(df)``):

    >>> df.apply(np.sqrt)
         A    B
    0  2.0  3.0
    1  2.0  3.0
    2  2.0  3.0

    Using a reducing function on either axis

    >>> df.apply(np.sum, axis=0)
    A    12
    B    27
    dtype: int64

    >>> df.apply(np.sum, axis=1)
    0    13
    1    13
    2    13
    dtype: int64

    Returning a list-like will result in a Series

    >>> df.apply(lambda x: [1, 2], axis=1)
    0    [1, 2]
    1    [1, 2]
    2    [1, 2]
    dtype: object

    Passing ``result_type='expand'`` will expand list-like results
    to columns of a Dataframe

    >>> df.apply(lambda x: [1, 2], axis=1, result_type='expand')
       0  1
    0  1  2
    1  1  2
    2  1  2

    Returning a Series inside the function is similar to passing
    ``result_type='expand'``. The resulting column names
    will be the Series index.

    >>> df.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)
       foo  bar
    0    1    2
    1    1    2
    2    1    2

    Passing ``result_type='broadcast'`` will ensure the same shape
    result, whether list-like or scalar is returned by the function,
    and broadcast it along the axis. The resulting column names will
    be the originals.

    >>> df.apply(lambda x: [1, 2], axis=1, result_type='broadcast')
       A  B
    0  1  2
    1  1  2
    2  1  2

In [88]:
frame

               b         d         e
Utah   -1.273310 -2.511725  0.153381
Ohio    0.564593 -0.260594  2.064632
Texas   1.150681  0.695585 -0.994101
Oregon -2.968150 -0.532528 -1.763507

In [92]:
f

In [93]:
# 세로 방향 최댓값이 1.150681 최솟값이 -2.968150면 lamda x는 4.118831이 나옴
# apply는 파라미터 값을 안 주면 기본적으로 열 기준으로 연산됨(세로 방향)

frame.apply(f)   # axis=0  [디폴트값] axis=0은 행을 의미(행들이 대상)

b    4.118831
d    3.207310
e    3.828139
dtype: float64

In [94]:
# 가로 방향 최댓값이 0.153381이고 최솟값이 -2.511725면 lamda x는 2.665106이 나옴
# axis=1은 열을 의미하나 연산시에는 가로 방향(열들이 대상)
frame.apply(f, axis=1)

Utah      2.665106
Ohio      2.325226
Texas     2.144782
Oregon    2.435623
dtype: float64

In [95]:
# 참조 주소 f를 주지 않고 직접 lambda를 대입할 때(주로 이게 많이 쓰임)
# 위와 결과 동일

frame.apply(lambda x: x.max()-x.min(), axis=1)

Utah      2.665106
Ohio      2.325226
Texas     2.144782
Oregon    2.435623
dtype: float64

In [96]:
# 위에서는 람다식을 apply에 사용하였으나

# 이번에는 def 함수와 apply 사용해서 최솟값과 최댓값 나타내기
# 위의 람다식의 참조주소와 무관한 f(x)임

def f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

# x.min(), x.max()가 데이터 값이 되고 인덱스가 min, max가 됨
# frame에서 apply(f)를 하면 각 열 별로 최솟값과 최댓값이 나오므로 
# 각 컬럼당 시리즈가 만들어지고 그래서 총 3개의 시리즈가 반환됨
# 따라서, 총 6개의 데이터가 리턴됨
# 리턴하는 자료형을 개발자가 지정할 수 있음(여기서는 시리즈로 리턴)

In [97]:
# 함수를 다른 함수에 인자로 전달할 때 파이썬에서는 함수 이름만 사용
# 이러면 호출된 함수의 실행이 아니라 해당 함수의 참조(또는 주소)만 전달하게 됨
# apply 메서드는 전달된 함수 f의 참조를 사용하여 데이터프레임의 각 열에 적용하려고 시도
# apply 메서드 내부에서 전달된 함수 f가 각각의 열에 의해 호출되며, 이때 f(x)와 같이 인자로 열이 전달
# 각 열에 대한 처리를 위해 전달된 함수가 실행되면서 원하는 결과를 얻음

frame.apply(f)   # 각 컬럼의 최소 , 최대값을 Series에 저장하여 리턴

            b         d         e
min -2.968150 -2.511725 -1.763507
max  1.150681  0.695585  2.064632

In [100]:
type(frame.apply(f))  # 시리즈가 합쳐져 데이터 프레임으로 리턴된 것을 알 수 있음

pandas.core.frame.DataFrame

In [99]:
# 함수에 함수를 넣는 또 다른 예)

def square(x):
    return x * x

numbers = [1, 2, 3, 4, 5]

squared_numbers = list(map(square, numbers))
squared_numbers 

# square 함수가 map 함수에 인자로 전달됨(x)는 전달되지 않음
# 이렇게 하면 map 함수는 square 함수를 각 numbers에 적용하여 제곱된 값을 얻음.
# square 함수는 map 함수에 인자로 전달되며, 괄호를 사용하지 않음. 
# 이렇게 하면 map 함수는 square 함수를 각 numbers에 적용하여 제곱된 값을 얻음

[1, 4, 9, 16, 25]

In [ ]:
# 함수 map() 에 대한 설명

# map() 함수는 주어진 함수를 입력된 반복 가능한(iterable) 객체의 각 요소에 적용하여 순서대로 값을 반환하는 함수
# map 객체는 순서가 보존되며 주어진 함수를 적용한 결과 값을 포함
# map() 함수의 반환값은 딕셔너리와 같은 키-값 구조가 아닌, 각 원소에 대해 적용된 변환 함수의 결과가 순서대로 저장된 일련의 값들임

# map() 함수는 첫 번째 인수로 변환 함수를 받고, 두 번째 인수로 반복 가능한 객체를 받습니다. 그리고 반환된 결과는 순서가 보존된 map 객체임
# map은 파라미터를 항상 2개를 갖고 apply함수처럼 파라미터로 넣은 함수를 파라미터로 준 또다른 원소에 적용하여 순서대로 값을 반환하는 함수임

In [501]:
# 데이터를 포맷하는 방법

# 람다 함수(익명 함수)를 생성하고 x값이 오면 문자열 {:.2f}를 x[한 개의 컬럼을 가리키게 됨]로 포맷
# f가 실수(플롯)을 의미하고 .2가 소숫점 이하 두 자리를 의미. ('%.2f')로 포맷하는 역할
# : 포맷 명령의 시작을 나타냅. (포맷[서식]을 추가 지정할 때)
# .2 : 소수점 이하 두 자리까지 표시하도록 지시
# f : 부동 소수점 숫자를 가리키는 형식 지정자
# 기본 문자열 포맷시엔 {} 이것만 씀

format = lambda x: '{:.2f}'.format(x)

In [502]:
frame.applymap(format)

            b      d      e
Utah     0.90   0.48  -0.16
Ohio    -0.39  -1.90  -0.88
Texas    0.40  -0.33   1.07
Oregon  -0.33  -0.14   0.89

## apply, map applymap 함수 설명

* applymap은 apply 함수의 특징과 map함수의 특징을 합친 것
<br>

* apply(pandas): 데이터프레임의 행 또는 열 기준으로 적용. 시리즈로 반환. 열 단위로 함수를 적용하며, 함수를 적용할 축을 지정할 수 있음 
<br>행 또는 열 단위로 사용자가 정의한 함수를 적용할 수 있는 함수
<br>데이터프레임에서 사용하며, 특정 행 또는 열에 대해 사용자 정의 함수를 적용할 때 사용.
<br>주요 목적은 데이터 분석에서 행 또는 열 단위로 통계, 요약, 그룹화, 변환 등의 연산을 수행하는 것.
<br>    
    
* map(파이썬 내장): 시리즈에서만 사용할 수 있음. 
<br> 시리즈 내의 각 요소에 함수를 적용하여 변환. 주로 시리즈 내의 값들을 변경하거나 매핑시 사용
<br> 파이썬 내장 함수로서, 주어진 함수를 리스트, 튜플, 문자열 등 반복 가능한(iterable) 객체의 각 원소에 적용. 
<br> 반환되는 결과는 순서가 유지되는 map 객체
<br> 리스트, 튜플, 문자열 등 반복 가능한(iterable) 객체에서 사용.
<br> 변환 함수를 반복 가능한 객체의 각 원소에 적용하려는 목적으로 사용.
<br>  주로 파이썬 컬렉션과 함께 사용되며, pandas에서는 시리즈에도 사용할 수 있음. <br>
<br>

* applymap(pandas): 데이터프레임 내의 모든 요소에 함수 적용해 변환. 데이터프레임의 각 셀에 개별적으로 함수를 적용하여 값을 변환시 사용
<br> 주어진 함수를 데이터프레임 각 원소에 적용하여 새로운 데이터프레임을 반환. 원본 데이터프레임에는 영향을 주지 않음
<br> 데이터프레임에서 사용하며, 모든 원소에 대해 사용자 정의 함수를 일괄적으로 적용할 때 사용.
<br> 주요 목적은 데이터프레임의 원소별 변환 및 처리를 수행하는 것. <br>